Revit 2027 API
ParameterTypeId.DimStyleLinearUnits Property
 "Units Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimStyleLinearUnits { get; }
Public Shared ReadOnly Property DimStyleLinearUnits As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimStyleLinearUnits {
	ForgeTypeId^ get ();
}
static member DimStyleLinearUnits : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace